{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "DeclineBooking",
    "1": "MakeBooking",
    "2": "RequestAmenitiesInfo",
    "3": "RequestOtherHotel",
    "4": "ThankYou"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "DeclineBooking": 0,
    "MakeBooking": 1,
    "RequestAmenitiesInfo": 2,
    "RequestOtherHotel": 3,
    "ThankYou": 4
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
